      * Hello, world written in COBOL
       IDENTIFICATION DIVISION.
           PROGRAM-ID. Hello.

       PROCEDURE DIVISION.
         Hello.
           DISPLAY "Hello, World".
           STOP RUN.
